// src/data.js
export const subjects = {
  microbiology: {
    name: "Микробиология",
    topics: [
      {
        name: "Тема 1",
        questions: [
          {
            question: "Что такое микроб?",
            answers: ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"],
            correct: 1,
            explanation: "Микроб - это ...",
          },
          {
            question: "Что такое микроб?",
            answers: ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"],
            correct: 1,
            explanation: "Микроб - это ...",
          },
        ],
      },
    ],
  },
  biochemistry: {
    name: "Биохимия",
    topics: [
      {
        name: "Тема 1",
        questions: [
          {
            question: " К простым белкам относятся все, кроме: ",
            answers: ["альбумины", "протамины", "гистоны ", "цитохромы"],
            correct: 3,
            explanation:
              "Правильный ответ — D. цитохромы.Цитохромы — это белки, в структуре которых есть металлы, обычно железо, что делает их сложными белками, а не простыми. Простые белки, как альбумины, протамины и гистоны, состоят исключительно из аминокислот. Комплексные белки, такие как цитохромы, помимо аминокислот, содержат дополнительные компоненты, такие как металлы или другие небелковые молекулы, что отличает их от простых белков.",
          },
          {
            question: " К простым белкам относятся все, кроме: ",
            answers: ["альбумины", "протамины", "гистоны ", "цитохромы"],
            correct: 3,
            explanation:
              "Правильный ответ — D. цитохромы.Цитохромы — это белки, в структуре которых есть металлы, обычно железо, что делает их сложными белками, а не простыми. Простые белки, как альбумины, протамины и гистоны, состоят исключительно из аминокислот. Комплексные белки, такие как цитохромы, помимо аминокислот, содержат дополнительные компоненты, такие как металлы или другие небелковые молекулы, что отличает их от простых белков.",
          },
          {
            question: " К простым белкам относятся все, кроме: ",
            answers: ["альбумины", "протамины", "гистоны ", "цитохромы"],
            correct: 3,
            explanation:
              "Правильный ответ — D. цитохромы.Цитохромы — это белки, в структуре которых есть металлы, обычно железо, что делает их сложными белками, а не простыми. Простые белки, как альбумины, протамины и гистоны, состоят исключительно из аминокислот. Комплексные белки, такие как цитохромы, помимо аминокислот, содержат дополнительные компоненты, такие как металлы или другие небелковые молекулы, что отличает их от простых белков.",
          },
          {
            question: " К простым белкам относятся все, кроме: ",
            answers: ["альбумины", "протамины", "гистоны ", "цитохромы"],
            correct: 3,
            explanation:
              "Правильный ответ — D. цитохромы.Цитохромы — это белки, в структуре которых есть металлы, обычно железо, что делает их сложными белками, а не простыми. Простые белки, как альбумины, протамины и гистоны, состоят исключительно из аминокислот. Комплексные белки, такие как цитохромы, помимо аминокислот, содержат дополнительные компоненты, такие как металлы или другие небелковые молекулы, что отличает их от простых белков.",
          },
        ],
      },
    ],
  },
};
